# <font color="green"><h3 align="center">Pandas Merge</h3></font>

In [1]:
import pandas as pd
df1 = pd.DataFrame({
    "staff_id": ["EMP001","EMP002","EMP003"],
    "age": [31,24,40],
})
df1

  staff_id  age
0   EMP001   31
1   EMP002   24
2   EMP003   40

In [2]:
df2 = pd.DataFrame({
   "staff_id": ["EMP002","EMP001","EMP003"],
    "salary": [60000,90000,100000], 
})
df2

  staff_id  salary
0   EMP002   60000
1   EMP001   90000
2   EMP003  100000

In [3]:
df3 = pd.merge(df1,df2, on="staff_id")

In [4]:
df3

  staff_id  age  salary
0   EMP001   31   90000
1   EMP002   24   60000
2   EMP003   40  100000

In [5]:
df1 = pd.DataFrame({
    "staff_id": ["EMP001","EMP002","EMP003","EMP008"],
    "age": [31,24,40, 50],
})
df1

  staff_id  age
0   EMP001   31
1   EMP002   24
2   EMP003   40
3   EMP008   50

In [6]:
df2 = pd.DataFrame({
   "staff_id": ["EMP002","EMP001","EMP003"],
    "age": [50,72,81], 
})
df2

  staff_id  age
0   EMP002   50
1   EMP001   72
2   EMP003   81

In [7]:
df3 = pd.merge(df1,df2, on="staff_id", how="inner")
df3

  staff_id  age_x  age_y
0   EMP001     31     72
1   EMP002     24     50
2   EMP003     40     81

In [8]:
df3 = pd.merge(df1,df2, on="staff_id", how="outer")
df3

  staff_id  age_x  age_y
0   EMP001     31   72.0
1   EMP002     24   50.0
2   EMP003     40   81.0
3   EMP008     50    NaN

In [9]:
df3 = pd.merge(df1,df2, on="staff_id", how="left")
df3

  staff_id  age_x  age_y
0   EMP001     31   72.0
1   EMP002     24   50.0
2   EMP003     40   81.0
3   EMP008     50    NaN

In [10]:
df3 = pd.merge(df1,df2, on="staff_id", how="right")
df3

  staff_id  age_x  age_y
0   EMP002     24     50
1   EMP001     31     72
2   EMP003     40     81

In [11]:
df3 = pd.merge(df1,df2, on="staff_id", how="outer", indicator = True)
df3

  staff_id  age_x  age_y     _merge
0   EMP001     31   72.0       both
1   EMP002     24   50.0       both
2   EMP003     40   81.0       both
3   EMP008     50    NaN  left_only

In [13]:
df3 = pd.merge(df1,df2, on="staff_id")

In [14]:
df3

  staff_id  age_x  age_y
0   EMP001     31     72
1   EMP002     24     50
2   EMP003     40     81